GopalSaraf/Practicals/PSDL/include/proc/pic16f15255.h
// Register: RX1PPS
#define RX1PPS RX1PPS
extern volatile unsigned char           RX1PPS              __at(0x1ECB);
#ifndef _LIB_BUILD
asm("RX1PPS equ 01ECBh");
#endif
// aliases
extern volatile unsigned char           RX1DTPPS            __at(0x1ECB);
#ifndef _LIB_BUILD
asm("RX1DTPPS equ 01ECBh");
#endif
extern volatile unsigned char           RXPPS               __at(0x1ECB);
#ifndef _LIB_BUILD
asm("RXPPS equ 01ECBh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned RX1DTPPS               :5;
    };
    struct {
        unsigned RX1DTPPS0              :1;
        unsigned RX1DTPPS1              :1;
        unsigned RX1DTPPS2              :1;
        unsigned RX1DTPPS3              :1;
        unsigned RX1DTPPS4              :1;
    };
} RX1PPSbits_t;
extern volatile RX1PPSbits_t RX1PPSbits __at(0x1ECB);
// bitfield macros
#define _RX1PPS_PIN_POSN                                    0x0
#define _RX1PPS_PIN_POSITION                                0x0
#define _RX1PPS_PIN_SIZE                                    0x3
#define _RX1PPS_PIN_LENGTH                                  0x3
#define _RX1PPS_PIN_MASK                                    0x7
#define _RX1PPS_PORT_POSN                                   0x3
#define _RX1PPS_PORT_POSITION                               0x3
#define _RX1PPS_PORT_SIZE                                   0x2
#define _RX1PPS_PORT_LENGTH                                 0x2
#define _RX1PPS_PORT_MASK                                   0x18
#define _RX1PPS_RX1DTPPS_POSN                               0x0
#define _RX1PPS_RX1DTPPS_POSITION                           0x0
#define _RX1PPS_RX1DTPPS_SIZE                               0x5
#define _RX1PPS_RX1DTPPS_LENGTH                             0x5
#define _RX1PPS_RX1DTPPS_MASK                               0x1F
#define _RX1PPS_RX1DTPPS0_POSN                              0x0
#define _RX1PPS_RX1DTPPS0_POSITION                          0x0
#define _RX1PPS_RX1DTPPS0_SIZE                              0x1
#define _RX1PPS_RX1DTPPS0_LENGTH                            0x1
#define _RX1PPS_RX1DTPPS0_MASK                              0x1
#define _RX1PPS_RX1DTPPS1_POSN                              0x1
#define _RX1PPS_RX1DTPPS1_POSITION                          0x1
#define _RX1PPS_RX1DTPPS1_SIZE                              0x1
#define _RX1PPS_RX1DTPPS1_LENGTH                            0x1
#define _RX1PPS_RX1DTPPS1_MASK                              0x2
#define _RX1PPS_RX1DTPPS2_POSN                              0x2
#define _RX1PPS_RX1DTPPS2_POSITION                          0x2
#define _RX1PPS_RX1DTPPS2_SIZE                              0x1
#define _RX1PPS_RX1DTPPS2_LENGTH                            0x1
#define _RX1PPS_RX1DTPPS2_MASK                              0x4
#define _RX1PPS_RX1DTPPS3_POSN                              0x3
#define _RX1PPS_RX1DTPPS3_POSITION                          0x3
#define _RX1PPS_RX1DTPPS3_SIZE                              0x1
#define _RX1PPS_RX1DTPPS3_LENGTH                            0x1
#define _RX1PPS_RX1DTPPS3_MASK                              0x8
#define _RX1PPS_RX1DTPPS4_POSN                              0x4
#define _RX1PPS_RX1DTPPS4_POSITION                          0x4
#define _RX1PPS_RX1DTPPS4_SIZE                              0x1
#define _RX1PPS_RX1DTPPS4_LENGTH                            0x1
#define _RX1PPS_RX1DTPPS4_MASK                              0x10
// alias bitfield definitions
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned RX1DTPPS               :5;
    };
    struct {
        unsigned RX1DTPPS0              :1;
        unsigned RX1DTPPS1              :1;
        unsigned RX1DTPPS2              :1;
        unsigned RX1DTPPS3              :1;
        unsigned RX1DTPPS4              :1;
    };
} RX1DTPPSbits_t;
extern volatile RX1DTPPSbits_t RX1DTPPSbits __at(0x1ECB);
// bitfield macros
#define _RX1DTPPS_PIN_POSN                                  0x0
#define _RX1DTPPS_PIN_POSITION                              0x0
#define _RX1DTPPS_PIN_SIZE                                  0x3
#define _RX1DTPPS_PIN_LENGTH                                0x3
#define _RX1DTPPS_PIN_MASK                                  0x7
#define _RX1DTPPS_PORT_POSN                                 0x3
#define _RX1DTPPS_PORT_POSITION                             0x3
#define _RX1DTPPS_PORT_SIZE                                 0x2
#define _RX1DTPPS_PORT_LENGTH                               0x2
#define _RX1DTPPS_PORT_MASK                                 0x18
#define _RX1DTPPS_RX1DTPPS_POSN                             0x0
#define _RX1DTPPS_RX1DTPPS_POSITION                         0x0
#define _RX1DTPPS_RX1DTPPS_SIZE                             0x5
#define _RX1DTPPS_RX1DTPPS_LENGTH                           0x5
#define _RX1DTPPS_RX1DTPPS_MASK                             0x1F
#define _RX1DTPPS_RX1DTPPS0_POSN                            0x0
#define _RX1DTPPS_RX1DTPPS0_POSITION                        0x0
#define _RX1DTPPS_RX1DTPPS0_SIZE                            0x1
#define _RX1DTPPS_RX1DTPPS0_LENGTH                          0x1
#define _RX1DTPPS_RX1DTPPS0_MASK                            0x1
#define _RX1DTPPS_RX1DTPPS1_POSN                            0x1
#define _RX1DTPPS_RX1DTPPS1_POSITION                        0x1
#define _RX1DTPPS_RX1DTPPS1_SIZE                            0x1
#define _RX1DTPPS_RX1DTPPS1_LENGTH                          0x1
#define _RX1DTPPS_RX1DTPPS1_MASK                            0x2
#define _RX1DTPPS_RX1DTPPS2_POSN                            0x2
#define _RX1DTPPS_RX1DTPPS2_POSITION                        0x2
#define _RX1DTPPS_RX1DTPPS2_SIZE                            0x1
#define _RX1DTPPS_RX1DTPPS2_LENGTH                          0x1
#define _RX1DTPPS_RX1DTPPS2_MASK                            0x4
#define _RX1DTPPS_RX1DTPPS3_POSN                            0x3
#define _RX1DTPPS_RX1DTPPS3_POSITION                        0x3
#define _RX1DTPPS_RX1DTPPS3_SIZE                            0x1
#define _RX1DTPPS_RX1DTPPS3_LENGTH                          0x1
#define _RX1DTPPS_RX1DTPPS3_MASK                            0x8
#define _RX1DTPPS_RX1DTPPS4_POSN                            0x4
#define _RX1DTPPS_RX1DTPPS4_POSITION                        0x4
#define _RX1DTPPS_RX1DTPPS4_SIZE                            0x1
#define _RX1DTPPS_RX1DTPPS4_LENGTH                          0x1
#define _RX1DTPPS_RX1DTPPS4_MASK                            0x10
typedef union {
    struct {
        unsigned PIN                    :3;
        unsigned PORT                   :2;
    };
    struct {
        unsigned RX1DTPPS               :5;
    };
    struct {
        unsigned RX1DTPPS0              :1;
        unsigned RX1DTPPS1              :1;
        unsigned RX1DTPPS2              :1;
        unsigned RX1DTPPS3              :1;
        unsigned RX1DTPPS4              :1;
    };
} RXPPSbits_t;
extern volatile RXPPSbits_t RXPPSbits __at(0x1ECB);
// bitfield macros
#define _RXPPS_PIN_POSN                                     0x0
#define _RXPPS_PIN_POSITION                                 0x0
#define _RXPPS_PIN_SIZE                                     0x3
#define _RXPPS_PIN_LENGTH                                   0x3
#define _RXPPS_PIN_MASK                                     0x7
#define _RXPPS_PORT_POSN                                    0x3
#define _RXPPS_PORT_POSITION                                0x3
#define _RXPPS_PORT_SIZE                                    0x2
#define _RXPPS_PORT_LENGTH                                  0x2
#define _RXPPS_PORT_MASK                                    0x18
#define _RXPPS_RX1DTPPS_POSN                                0x0
#define _RXPPS_RX1DTPPS_POSITION                            0x0
#define _RXPPS_RX1DTPPS_SIZE                                0x5
#define _RXPPS_RX1DTPPS_LENGTH                              0x5
#define _RXPPS_RX1DTPPS_MASK                                0x1F
#define _RXPPS_RX1DTPPS0_POSN                               0x0
#define _RXPPS_RX1DTPPS0_POSITION                           0x0
#define _RXPPS_RX1DTPPS0_SIZE                               0x1
#define _RXPPS_RX1DTPPS0_LENGTH                             0x1
#define _RXPPS_RX1DTPPS0_MASK                               0x1
#define _RXPPS_RX1DTPPS1_POSN                               0x1
#define _RXPPS_RX1DTPPS1_POSITION                           0x1
#define _RXPPS_RX1DTPPS1_SIZE                               0x1
#define _RXPPS_RX1DTPPS1_LENGTH                             0x1
#define _RXPPS_RX1DTPPS1_MASK                               0x2
#define _RXPPS_RX1DTPPS2_POSN                               0x2
#define _RXPPS_RX1DTPPS2_POSITION                           0x2
#define _RXPPS_RX1DTPPS2_SIZE                               0x1
#define _RXPPS_RX1DTPPS2_LENGTH                             0x1
#define _RXPPS_RX1DTPPS2_MASK                               0x4
#define _RXPPS_RX1DTPPS3_POSN                               0x3
#define _RXPPS_RX1DTPPS3_POSITION                           0x3
#define _RXPPS_RX1DTPPS3_SIZE                               0x1
#define _RXPPS_RX1DTPPS3_LENGTH                             0x1
#define _RXPPS_RX1DTPPS3_MASK                               0x8
#define _RXPPS_RX1DTPPS4_POSN                               0x4
#define _RXPPS_RX1DTPPS4_POSITION                           0x4
#define _RXPPS_RX1DTPPS4_SIZE                               0x1
#define _RXPPS_RX1DTPPS4_LENGTH                             0x1
#define _RXPPS_RX1DTPPS4_MASK                               0x10

